In [5]:
#Now we view another functionalities i.e. dropping an entry into an array which does not have those entries through an axis

import pandas as pd
import numpy as np
from pandas import Series, DataFrame

series_obj = Series(np.arange(5.), index = ['a','b','c','d','e'])
series_obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [7]:
#Values can be dropped using the drop method
series_obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [8]:
#The values to be dropped can also be a list of values
series_obj.drop(['a','c','d'])

b    1.0
e    4.0
dtype: float64

In [13]:
#In case of DataFrame, values canbe dropped from any axis given the axis number
frame_data = {'July': Series([12,3], index = [2001,2003]), 'December': Series([19,21], index = [1998,2003])}
frame_obj = DataFrame(frame_data)
frame_obj

      July  December
1998   NaN      19.0
2001  12.0       NaN
2003   3.0      21.0

In [16]:
frame_obj.drop([2001])

      July  December
1998   NaN      19.0
2003   3.0      21.0

In [17]:
frame_obj.drop([1998,2003])

      July  December
2001  12.0       NaN

In [18]:
frame_obj.drop(['July'],axis=1)

      December
1998      19.0
2001       NaN
2003      21.0